{
  "title": "Andy Ledesma García",
  "subtitle": "Blockchain Developer • CTO • Full-stack Developer • Computer Scientist",
  "sections": {
    "resume": "Résumé (CV)",
    "contact": "I wanna hear from you",
    "review_title": "Know me? Leave a review",
    "review_button": "Leave a Review",
    "profiles": "Professional Profiles",
    "teams": "From the Teams of",
    "stats": "Stats",
    "blockchain": "My life so far",
    "language": "Language"
  },
  "navigation": {
    "home": "Home",
    "cv": "CV",
    "say_hi": "Say Hi",
    "reviews": "Reviews",
    "blog": "Blog"
  },
  "resume": {
    "title": "Résumé",
    "action": "Download",
    "contact_cta": "Click to contact",
    "availability": "Available for New Opportunities",
    "summary": "Results-driven Blockchain Engineer and Computer Scientist with 5+ years of experience across 7 organizations. Enhanced and further developed a pioneering Real World Asset (RWA) tokenization platform at Token Fleet, connecting Dubai's car rental businesses with stablecoins and global investors through ERC-20 and ERC-721 implementations. Served as Blockchain Technical Lead at Fusyona, directing development teams that built DeFi protocols, decentralized exchanges, NFT marketplaces, and token launchpads. Expert Full-stack Developer specializing in Solidity, Golang, TypeScript, Next.js, C#, and .NET. Successfully integrated Web2/Web3 systems across multiple enterprise projects. Former University Instructor teaching advanced programming and blockchain development."
  },
  "contact": {
    "whatsapp": "WhatsApp",
    "telegram": "Telegram",
    "email": "Email",
    "message": "Drop me a message, I'd love to chat!"
  },
  "profiles": {
    "linkedin": "LinkedIn",
    "linkedin_desc": "Professional Network",
    "github": "GitHub",
    "github_desc": "Code Repository"
  },
  "stats": {
    "experience": "Years of Experience",
    "loc": "Lines of Code",
    "projects": "Projects",
    "organizations": "Organizations"
  },
  "blockchain": {
    "title": "My life so far",
    "blocks": [
      {
        "data": "Born on September 9th, 1999 in Cuba within a humble family. My family taught me useful lessons and the love for science."
      },
      {
        "data": "My dad taught me chess when I was 4 years old, and by 11, I was already the best in my area. Thanks to this, I developed strong abstract thinking from an early age. PS: He used to beat me back then, now I win 😎."
      },
      {
        "data": "In September 2014, I began my studies at the <a href=\"https://www.linkedin.com/school/ipvce-lenin/\" target=\"_blank\" rel=\"noopener noreferrer\" style=\"color: #3b82f6; text-decoration: underline;\">Exact Sciences Institute Vladimir I. Lenin</a>, where I focused on science and learned programming in C++."
      },
      {
        "data": "I started competing in programming contests at age 15, mastering C++ to tackle advanced algorithms and data structures, and ranked in the top 11 nationally for my age in 2016.",
        "caption": "with <a href=\"https://www.linkedin.com/in/enrique-mart%C3%ADnez-gonz%C3%A1lez-948b19214/\" target=\"_blank\" rel=\"noopener noreferrer\" style=\"color: #3b82f6; text-decoration: underline;\">Enrique</a> and <a href=\"https://www.linkedin.com/in/davidmga44/\" target=\"_blank\" rel=\"noopener noreferrer\" style=\"color: #3b82f6; text-decoration: underline;\">David</a>"
      },
      {
        "data": "In December 2022, I graduated with a degree in Computer Science from the <a href=\"https://www.linkedin.com/school/universidad-de-la-habana/\" target=\"_blank\" rel=\"noopener noreferrer\" style=\"color: #3b82f6; text-decoration: underline;\">University of Havana</a>, ranking 6th in my class. I took optional blockchain courses and developed a decentralized voting system on Quorum (an Ethereum fork) as my thesis."
      },
      {
        "data": "In January 2023, I joined the Fusyona team, working for over two years on DeFi, SciFi, and GameFi protocols, collaborating closely with LayerZero, SKALE, Taraxa, and Sei."
      },
      {
        "data": "From February 2023 to September 2024, I taught undergraduate Computer Science and Data Science curricula at the <a href=\"https://www.linkedin.com/school/universidad-de-la-habana/\" target=\"_blank\" rel=\"noopener noreferrer\" style=\"color: #3b82f6; text-decoration: underline;\">University of Havana</a>, delivering advanced Database Systems and Computer Architecture courses to approximately 150 students, and mentored a blockchain research project, supervising thesis development."
      },
      {
        "data": "On December 12, 2024, I moved to Dubai to take my career to the next level, leveraging first-world infrastructure and resources to become more efficient at work."
      },
      {
        "data": "Near the end of December 2024, I joined the <a href=\"https://tokenfleet.io\" target=\"_blank\" rel=\"noopener noreferrer\" style=\"color: #3b82f6; text-decoration: underline;\">TokenFleet</a> team, working on both backend and frontend code and developing smart contracts to power the TokenFleet RWA protocol."
      },
      {
        "data": "During Token2049 Week (April 27–May 4, 2025), I showcased the TokenFleet projects to investors, marketers, and engineers, forging valuable connections and sparking exciting collaborations."
      },
      {
        "data": "As a volunteer at EthDubai 2025, I was part of the staff that welcomed every investor, speaker, and attendee. We provided IDs and guidance for a seamless stay, maintained security, and resolved any issues to ensure smooth conferences and talks."
      }
    ],
    "miningMessage": "...and I'm still mining..."
  },
  "teams": {
    "tokenfleet": {
      "name": "TokenFleet",
      "description": "RWA tokenization platform"
    },
    "fusyfox": {
      "name": "FusyFox",
      "description": "Innovative gaming experience"
    }
  },
  "footer": {
    "beforeDubai": "Made with ❤️ in",
    "afterDubai": "by Andy Ledesma García",
    "rights": "All rights reserved",
    "privacy_policy": "Privacy Policy",
    "contact": "Contact",
    "blog": "Blog"
  },
  "review_page": {
    "title": "Thanks for your review!",
    "message": "You rated with {rating} stars.",
    "go_back_home": "Go back home",
    "form": {
      "title": "Leave your review about me",
      "full_name": "Full Name",
      "contact_method": "Contact Method",
      "contact_info": "Contact Information",
      "linkedin": "LinkedIn",
      "email": "Email",
      "telegram": "Telegram",
      "phone": "Phone Number",
      "submit_button": "Submit Review",
      "submitting_button": "Submitting...",
      "success_message": "Thank you! Your review has been submitted successfully.",
      "errors": {
        "invalid_email": "Please enter a valid email address.",
        "invalid_linkedin": "Please enter a valid LinkedIn profile URL.",
        "invalid_telegram": "Please enter a valid Telegram handle (e.g., @username).",
        "invalid_phone": "Please enter a valid phone number."
      },
      "experience_label": "Care to share more about your experience? (Optional)",
      "experience_placeholder": "Tell me about our journey together...",
      "consent_checkbox": "I understand that my review, full name, and contact information will be stored and displayed publicly on this website for testimonial and verification purposes.",
      "consent_checkbox_link_text": "By submitting, you agree to the"
    }
  },
  "language": {
    "switch": "🇪🇸 Español"
  },
  "quote": "The dragons are mighty, but behind me lies a graveyard of them,\nand every tomb bears my signature.",
  "privacy_policy": {
    "title": "Privacy Policy",
    "last_updated": "Last Updated: August 26, 2025",
    "introduction": "Welcome to my personal website! This Privacy Policy explains how I collect, use, and protect your information when you leave a review. Your trust is important to me, and I'm committed to protecting your privacy.",
    "data_we_collect": {
      "title": "What Information Do I Collect?",
      "items": [
        "<strong>Full Name:</strong> To know who you are.",
        "<strong>Contact Information:</strong> Your chosen method (Email, LinkedIn, Telegram, or Phone), allowing me and others to contact you regarding your review.",
        "<strong>Your Experience:</strong> The review and comments you write about our collaboration.",
        "<strong>Rating:</strong> The star rating you provide."
      ]
    },
    "how_we_use_data": {
      "title": "How I Use Your Information",
      "items": [
        "<strong>To Display Your Review:</strong> Your review, full name, and rating may be publicly displayed on my website's home page or other sections to showcase my work and collaborations.",
        "<strong>To Contact You & For Verification:</strong> I may use your contact information to thank you for your review or to clarify details. It may also be displayed with your review to allow others (like potential clients or employers) to verify the testimonial.",
        "<strong>To Improve My Services:</strong> Your feedback helps me understand what I'm doing well and where I can improve."
      ]
    },
    "data_sharing": {
      "title": "Data Sharing and Storage",
      "content": "I do not sell or trade your personal information. Your review data, including your name and testimonial, is stored securely. Your contact information may be displayed publicly alongside your review as described above. Other than this public display, it will not be shared with third parties."
    },
    "your_rights": {
      "title": "Your Rights",
      "content": "You have the right to request the removal of your review from my website at any time. To do so, please contact me through one of the methods listed on the site, and I will promptly handle your request."
    },
    "contact": {
      "title": "Contact Me",
      "content": "If you have any questions about this Privacy Policy, feel free to <a href='/#links' class='text-blue-500 hover:underline'>reach out</a>. Thank you for your trust and for taking the time to leave a review!"
    }
  }
}
