{
  "title": "Andy Ledesma García",
  "subtitle": "Desarrollador Blockchain • CTO • Desarrollador Full-stack • Científico de la Computación",
  "sections": {
    "resume": "Currículum Vitae",
    "contact": "Quiero saber de ti",
    "review_title": "¿Me conoces? Deja una reseña",
    "review_button": "Dejar una reseña",
    "profiles": "Perfiles Profesionales",
    "teams": "De los Equipos de"
  },
  "navigation": {
    "home": "Inicio",
    "cv": "CV",
    "say_hi": "Saludar",
    "reviews": "Reseñas",
    "blog": "Blog"
  },
  "resume": {
    "title": "Currículum",
    "action": "Descargar",
    "contact_cta": "Haz clic para contactar",
    "availability": "Disponible para Nuevas Oportunidades",
    "summary": "Profesional orientado a resultados, <strong>Ingeniero Blockchain</strong> y <strong>Científico de la Computación</strong> con <strong>más de 5 años</strong> de experiencia en 7 organizaciones. Mejoró y desarrolló una pionera plataforma de tokenización de Activos del Mundo Real (RWA) en Token Fleet, conectando negocios de alquiler de coches en Dubái con stablecoins e inversores globales a través de implementaciones ERC-20 y ERC-721. Ejerció como Líder Técnico de Blockchain en Fusyona, dirigiendo equipos de desarrollo que construyeron protocolos DeFi, exchanges descentralizados, mercados NFT y plataformas de lanzamiento de tokens. Desarrollador Full-stack experto especializado en Solidity, Golang, TypeScript, Next.js, C# y .NET. Integró con éxito sistemas Web2/Web3 en múltiples proyectos empresariales. Ex Profesor Universitario impartiendo programación avanzada y desarrollo blockchain."
  },
  "contact": {
    "whatsapp": "WhatsApp",
    "telegram": "Telegram",
    "email": "Correo Electrónico",
    "message": "Escríbeme, ¡me encantaría charlar!"
  },
  "profiles": {
    "linkedin": "LinkedIn",
    "linkedin_desc": "Red Profesional",
    "github": "GitHub",
    "github_desc": "Repositorio de Código"
  },
  "stats": {
    "experience": "Años de Experiencia",
    "loc": "Líneas de Código",
    "projects": "Proyectos",
    "organizations": "Organizaciones"
  },
  "blockchain": {
    "title": "Mi vida hasta ahora",
    "blocks": [
      {
        "data": "Nacido el 9 de septiembre de 1999 en Cuba en el seno de una familia humilde. Mi familia me enseñó lecciones útiles y el amor por la ciencia."
      },
      {
        "data": "Mi papá me enseñó a jugar ajedrez a los 4 años y a los 11 ya era el mejor de mi área. Gracias a eso desarrollé un gran poder de abstracción desde edades tempranas. PD: él me ganaba entonces, ahora gano yo 😎."
      },
      {
        "data": "En septiembre de 2014, inicié mis estudios en el <a href=\"https://www.linkedin.com/school/ipvce-lenin/\" target=\"_blank\" rel=\"noopener noreferrer\" style=\"color: #3b82f6; text-decoration: underline;\">Instituto de Ciencias Exactas Vladimir I. Lenin</a>, donde me enfoqué en las ciencias y aprendí a programar en C++."
      },
      {
        "data": "Comencé a competir en concursos de programación a los 15 años, dominando C++ para resolver problemas con algoritmos avanzados y estructuras de datos, y me clasifiqué entre los 11 mejores a nivel nacional en mi categoría en 2016.",
        "caption": "con <a href=\"https://www.linkedin.com/in/enrique-mart%C3%ADnez-gonz%C3%A1lez-948b19214/\" target=\"_blank\" rel=\"noopener noreferrer\" style=\"color: #3b82f6; text-decoration: underline;\">Enrique</a> y <a href=\"https://www.linkedin.com/in/davidmga44/\" target=\"_blank\" rel=\"noopener noreferrer\" style=\"color: #3b82f6; text-decoration: underline;\">David</a>"
      },
      {
        "data": "En diciembre de 2022, me gradué en Ciencias de la Computación en la <a href=\"https://www.linkedin.com/school/universidad-de-la-habana/\" target=\"_blank\" rel=\"noopener noreferrer\" style=\"color: #3b82f6; text-decoration: underline;\">Universidad de La Habana</a>, quedando 6º de mi promoción. Asistí a cursos optativos de blockchain y desarrollé un sistema de votación descentralizado en Quorum (un fork de Ethereum) como tesis."
      },
      {
        "data": "En enero de 2023, me uní al equipo de Fusyona, trabajando durante más de dos años en protocolos DeFi, SciFi y GameFi, colaborando estrechamente con LayerZero, SKALE, Taraxa y Sei."
      },
      {
        "data": "De febrero de 2023 a septiembre de 2024, impartí los programas de Licenciatura en Ciencias de la Computación y Ciencia de Datos en la <a href=\"https://www.linkedin.com/school/universidad-de-la-habana/\" target=\"_blank\" rel=\"noopener noreferrer\" style=\"color: #3b82f6; text-decoration: underline;\">Universidad de La Habana</a>, ofreciendo cursos avanzados de Sistemas de Bases de Datos y Arquitectura de Computadoras a aproximadamente 150 estudiantes, y mentoreé un proyecto de investigación en blockchain, supervisando el desarrollo de tesis."
      },
      {
        "data": "El 12 de diciembre de 2024, me mudé a Dubái para llevar mi carrera al siguiente nivel, aprovechando la infraestructura y los recursos de primer mundo para ser más eficiente en el trabajo."
      },
      {
        "data": "A finales de diciembre de 2024, me uní al equipo de <a href=\"https://tokenfleet.io\" target=\"_blank\" rel=\"noopener noreferrer\" style=\"color: #3b82f6; text-decoration: underline;\">TokenFleet</a>, trabajando tanto en backend como en frontend y desarrollando contratos inteligentes para impulsar el protocolo RWA de TokenFleet."
      },
      {
        "data": "Durante la semana de Token2049 (27 de abril – 4 de mayo de 2025), presenté los proyectos de TokenFleet a inversionistas, mercadólogos e ingenieros, forjando conexiones valiosas y despertando entusiasmo."
      },
      {
        "data": "Como voluntario en EthDubai 2025, formé parte del staff que recibió a cada inversionista, conferencista y asistente en general. Entregamos identificaciones e indicaciones para una estancia sin contratiempos. También mantuvimos la seguridad del lugar y resolvimos cualquier problema que amenazara el buen desarrollo de conferencias y charlas."
      }
    ],
    "miningMessage": "...y sigo minando..."
  },
  "teams": {
    "tokenfleet": {
      "name": "TokenFleet",
      "description": "Plataforma de tokenización RWA"
    },
    "fusyfox": {
      "name": "FusyFox",
      "description": "Experiencia innovadora de juego"
    }
  },
  "blog": {
    "title": "Blog",
    "under_construction": "En Construcción",
    "coming_soon": "¡Próximamente!",
    "description": "Estoy trabajando en contenido emocionante para mi blog. Manténte atento para una variedad de artículos que cubren mis intereses, experiencias y perspectivas.",
    "expected_launch": "Lanzamiento previsto: Octubre 2025",
    "follow_on_linkedin": "¡Sígueme en LinkedIn para recibir notificaciones cuando haya nuevas publicaciones!",
    "return_home": "Ir atrás"
  },
  "footer": {
    "footer_made_with": "Hecho con",
    "footer_in": "en",
    "afterDubai": "por Andy Ledesma García",
    "rights": "Todos los derechos reservados",
    "privacy_policy": "Política de Privacidad",
    "contact": "Contacto",
    "blog": "Blog",
    "version": "Versión"
  },
  "review_page": {
    "title": "¡Gracias por tu reseña!",
    "message": "Calificaste con {rating} estrellas.",
    "go_back_home": "Volver al inicio",
    "form": {
      "title": "Deja tu reseña sobre mí",
      "full_name": "Nombre Completo",
      "contact_method": "Método de Contacto",
      "contact_info": "Información de Contacto",
      "linkedin": "LinkedIn",
      "email": "Correo",
      "telegram": "Telegram",
      "phone": "Teléfono",
      "submit_button": "Enviar Reseña",
      "submitting_button": "Enviando...",
      "success_message": "¡Gracias! Tu reseña ha sido enviada con éxito.",
      "errors": {
        "invalid_email": "Por favor, introduce una dirección de correo electrónico válida.",
        "invalid_linkedin": "Por favor, introduce una URL de perfil de LinkedIn válida.",
        "invalid_telegram": "Por favor, introduce un usuario de Telegram válido (p. ej., @usuario).",
        "invalid_phone": "Por favor, introduce un número de teléfono válido."
      },
      "experience_label": "¿Quieres compartir más sobre tu experiencia? (Opcional)",
      "experience_placeholder": "Cuéntame sobre nuestro viaje juntos...",
      "consent_checkbox": "Entiendo que mi reseña, nombre completo e información de contacto serán almacenados y mostrados públicamente en este sitio web con fines testimoniales y de verificación.",
      "consent_checkbox_link_text": "Al enviar, aceptas la"
    }
  },
  "language": {
    "switch": "🇺🇸 English"
  },
  "quote": "Son grandes los dragones, pero a mis espaldas tengo un cementerio de ellos\ny en sus tumbas está mi firma.",
  "privacy_policy": {
    "title": "Política de Privacidad",
    "last_updated": "Última Actualización: 26 de Agosto de 2025",
    "introduction": "¡Bienvenido a mi sitio web personal! Esta Política de Privacidad explica cómo recopilo, uso y protejo tu información cuando dejas una reseña. Tu confianza es importante para mí y estoy comprometido con la protección de tu privacidad.",
    "data_we_collect": {
      "title": "¿Qué Información Recopilo?",
      "items": [
        "<strong>Nombre Completo:</strong> Para saber quién eres.",
        "<strong>Información de Contacto:</strong> El método que elijas (Correo, LinkedIn, Telegram o Teléfono), permitiendo que yo y otros podamos contactarte sobre tu reseña.",
        "<strong>Tu Experiencia:</strong> La reseña y los comentarios que escribes sobre nuestra colaboración.",
        "<strong>Calificación:</strong> La calificación de estrellas que proporcionas."
      ]
    },
    "how_we_use_data": {
      "title": "¿Cómo Uso Tu Información?",
      "items": [
        "<strong>Para Mostrar Tu Reseña:</strong> Tu reseña, nombre completo y calificación pueden mostrarse públicamente en la página de inicio de mi sitio web u otras secciones para mostrar mi trabajo y colaboraciones.",
        "<strong>Para Contactarte y Para Verificación:</strong> Puedo usar tu información de contacto para agradecerte por tu reseña o para aclarar detalles. También podría mostrarse con tu reseña para permitir que otros (como potenciales clientes o empleadores) verifiquen el testimonio.",
        "<strong>Para Mejorar Mis Servicios:</strong> Tus comentarios me ayudan a entender qué estoy haciendo bien y dónde puedo mejorar."
      ]
    },
    "data_sharing": {
      "title": "Uso Compartido y Almacenamiento de Datos",
      "content": "No vendo ni comercializo tu información personal. Los datos de tu reseña, incluyendo tu nombre y testimonio, se almacenan de forma segura. Tu información de contacto podría mostrarse públicamente junto a tu reseña como se describe arriba. Aparte de esta exhibición pública, no se compartirá con terceros."
    },
    "your_rights": {
      "title": "Tus Derechos",
      "content": "Tienes derecho a solicitar la eliminación de tu reseña de mi sitio web en cualquier momento. Para ello, por favor, contáctame a través de uno de los métodos listados en el sitio, y atenderé tu solicitud a la brevedad."
    },
    "contact": {
      "title": "Contáctame",
      "content": "Si tienes alguna pregunta sobre esta Política de Privacidad, no dudes en <a href='/#links' class='text-blue-500 hover:underline'>contactarme</a>. ¡Gracias por tu confianza y por tomarte el tiempo para dejar una reseña!"
    }
  }
}
